Show / Hide Table of Contents
Class NadSetupValue
Setup value base
Inheritance
System.Object
NadSetupValue
NadSetupValueBool
NadSetupValueDouble
NadSetupValueFloat
NadSetupValueInt
NadSetupValueLong
NadSetupValueShort
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class NadSetupValue
Properties
Improve this Doc   View Source
Id
Gets or sets the value id.
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
IsActive
Is active
Declaration
public bool IsActive { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source